# Home work 4
# Пользователь вводит целое положительное число. Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.

while True:
    number = input("введите число : ")
    print(max(number))
    break

print(type(number))
print(max(number))

